In [1]:
import sqlite3 as sql
import pandas

In [5]:
nf_data = pandas.read_csv('C:/Users/Felix/Box Sync/UW/R/nf.csv')

In [2]:
# Example: NF_player_07142021
table_name = input()

NF_player_07212021

In [3]:
# connect to database
conn = sql.connect('NF_player_data.db')

In [6]:
# store data
nf_data.to_sql(table_name, conn, if_exists = 'replace', index = False)

In [7]:
df = pandas.read_sql('select * from NF_player_07212021', conn)
df

,id,wins,battles,fleet,squad,activity,win_rate
0,ms06zaku,60190,92515,BAMF FLEET,BULLS,07.20.2021,0.650597
1,aspid47,39299,66908,Russian Alliance,Nakhimov,07.21.2021,0.587359
2,laoji,37700,55611,兔子.CHN.,-,07.20.2021,0.677923
3,mikieboy666,35729,60097,-,-,07.12.2021,0.594522
4,hungdiu,33985,62287,Ostseepiraten,-,06.26.2021,0.545619
...,...,...,...,...,...,...,...
10122,cvfg16,1286,2583,-,-,05.14.2021,0.497871
10123,charizard97,3821,6401,BAMF FLEET,Legacy,07.18.2021,0.596938
10124,cnm2b9h,744,1468,-,勇敢天下,03.17.2021,0.506812
10125,beifang0016,4456,8637,北方舰队,-,07.20.2021,0.515920
10126,aldaris584,2414,5592,-,-,07.20.2021,0.431688

In [10]:
# list table names
cursor = conn.cursor()
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cursor.fetchall())

[('NF_player_07072021',), ('NF_player_07142021',), ('firepower_season1',), ('firepower_season2',), ('firepower_season3',), ('firepower_season4',), ('firepower_season5',), ('firepower_season6',), ('firepower_season7',), ('firepower_season8',), ('firepower_season9',), ('firepower_season10',), ('firepower_season11',), ('firepower_season12',), ('NF_player_07212021',)]

In [9]:
# firepower finished seasons data store
for f in range(1,12):
    file_path = 'C:/Users/Felix/Box Sync/UW/R/'
    file_name = 'firepower_season' + str(f) + '.csv'
    file_source = file_path + file_name
    mydata = pandas.read_csv(file_source)
    db_table_name = 'firepower_season' + str(f)
    mydata.to_sql(db_table_name, conn, if_exists = 'replace', index = False)

In [12]:
# firepower season 12 data store
season_12 = pandas.read_csv('C:/Users/Felix/Box Sync/UW/R/firepower_season12.csv')
season_12.to_sql('firepower_season12', conn, if_exists = 'replace', index = False)

In [13]:
df = pandas.read_sql('select * from firepower_season12', conn)
df

             id  total_atk  highest_atk
0          pp12   85766686       420867
1      pashi001   70108862       384454
2         odmr1   59127993       386240
3          kp01   57952358       382669
4      linhai12   50832128       387042
...         ...        ...          ...
2665   mxychina          0            0
2666  cremolino          0            0
2667     gdi011          0            0
2668   nemo0981          0            0
2669     zc0526          0            0

[2670 rows x 3 columns]